
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"e3916b41faece88fe7eca4e222f7360dae87f3f4183582117396a01091a79ecd\"" -> "W/\"c3c5aa80adfa6a3fdf7d2c21b4d7424f89535e17fa6aacca061e576fcfdda325\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"fbda4293351421f513504422e1744d626533d6ee147c06d68945c76f7b763f02\"" -> "W/\"6df16709e12791ae7dd4c6f1b22bd82190def2b08cec52f2be64ba81f80bbee2\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-docker"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"f48b3e273b1d68697f935d8fca0eddce5006cde605bd7849def11884ba4ba7d9\"" -> "W/\"73db536837451619250ac9219d3e1e75ececa6aafc95a6a9df0d7082fd8e0316\""
        id                          = "kong-docker"
        name                        = "kong-docker"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"fabb82a83fc000da59c681f98c58be195aa24874216a6cbd9fd463b9f882d2e3\"" -> "W/\"2bc0c88cfe3b35d7814a1eae3f90cedeb444b5b3aff13c71c3a133d47b236b2d\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"468baf103ba77e2b750ef8daa04341392408067d868bbf157a4b4bd4f956349f\"" -> "W/\"3e42afeecc519c1f431210dc7f692370209ddf9708b7327af5c74480f4e9af80\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"b5b2bb20aa7f128e5b3947a23c42fe2615a5adcddc2488c5e9029566cf08d42c\"" -> "W/\"7bd8af94f2715dbefd3643d09ed5318cacba025d03f619b5f8f0d2795fbc94f2\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"a668b5ae9439c23aeb474ff3648b60f3c65770a92aa1d94abf15fb3585bcc6ab\"" -> "W/\"3692b551efc2b656873aa6859dd8f91452e0da7e255054ab60f43b1220600af6\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"3ce419a8b0cc6f25670eef1b2ec2aedda7b2179d6d1a27639ca13605e78cfe83\"" -> "W/\"d545a7ece3d6137dda73346952e9fabe37619e5f927413c07c57ba4bb02d0db4\""
        id                          = "template-template"
        name                        = "template-template"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_private_all["kong-fuzzy-testing"] has changed
  ~ resource "github_repository" "settings_private_all" {
      ~ etag                        = "W/\"a437703e18c1a62bfbc35f7728c2e35d6f63ef0d7d8be15e543747d9edff73c5\"" -> "W/\"b4aa7b43bb81f991f80220309ee4aad082f8165275df060b1939afeb44c42564\""
        id                          = "kong-fuzzy-testing"
        name                        = "kong-fuzzy-testing"
        # (32 unchanged attributes hidden)

      + security_and_analysis {

          + secret_scanning {
              + status = "disabled"
            }

          + secret_scanning_push_protection {
              + status = "disabled"
            }
        }

        # (1 unchanged block hidden)
    }

  # github_repository.settings_private_all["kong-test-suite"] has changed
  ~ resource "github_repository" "settings_private_all" {
      ~ etag                        = "W/\"15c2d4c03b86b3516e0cdeb3ce65cd927f26b00f20c6f1bc8e04a45f98b39697\"" -> "W/\"11902066398f0d12999ae087dd49f8914f29ac57897a6bea0b65fbd2ad563e80\""
        id                          = "kong-test-suite"
        name                        = "kong-test-suite"
        # (32 unchanged attributes hidden)

      + security_and_analysis {

          + secret_scanning {
              + status = "disabled"
            }

          + secret_scanning_push_protection {
              + status = "disabled"
            }
        }

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"cf1b95941dba95c2feb120c0823f4c2a5f6c94438da98a3fbfd9565b7e876eac\"" -> "W/\"86afa3265ea03ae0872a997ac439c04ca93f1a585e81299e253251597e6a804e\""
        id          = "1481994"
        name        = "protect-main-branch-atc-router-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"11f7a5159087f5cccf53ecc0c6facb9360a94810923f1823ec5c5eb88ffa0b54\"" -> "W/\"53818252cd24192b489fa5838329d4a0e7389b011b087fc17f4c7a93123372a8\""
        id          = "1430804"
        name        = "protect-main-branch-kong-build-images-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"1f7df648077ac15d7a6ad30c219122610d7cb0ffed804e5cb5ed28c3d37eb382\"" -> "W/\"4c2a49c1c8ebd24e3920ffe8e40b8e000376f9c12f2795e36a9b76747d6cf11c\""
        id          = "1430806"
        name        = "protect-main-branch-kong-development-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-docker"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"62a4cf0c8b9e313eb98df7e9b65f6e223761196685ed92d3b8e6871521d8719e\"" -> "W/\"577f0c0061787166e07655dc4e01d5ecf52a0f320471f3df24e832baf5dff858\""
        id          = "1491043"
        name        = "protect-main-branch-kong-docker-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-fuzzy-testing"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"2afebf04637a5762849e8fba074de875e69554472e41828f553600e69e64a241\"" -> "W/\"a09c269723f2817dc21f7d31f472991cda2c8e07ee4f6d9f4c2a80ccc40305d3\""
        id          = "1573964"
        name        = "protect-main-branch-kong-fuzzy-testing-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"e1dbf8388710ab4cb860ce6b87a500d8994dd4b5e3c2a1eadb5c179b66577cea\"" -> "W/\"993fd986cdbe141463b5ff738e89ae8ab24d6ae159187951a731e21cfbbed3dc\""
        id          = "1430805"
        name        = "protect-main-branch-kong-openssl-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"e3752b94201dc2400d5bb38a2133ee0703bfaad364906cc033d5c7bf6f977400\"" -> "W/\"cbb8004a817d318f028b056b535846d3621920580371ded69a20de6ceb159e77\""
        id          = "1430802"
        name        = "protect-main-branch-kong-package-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"f3a43179ee022ccac8e7d262f0774f9c5adbaf178766473c013634e9a6e7bbb6\"" -> "W/\"dbf534c46f7680b169c7e4fd41775cfe73a3dcb0574711e560b3a7ab92d66145\""
        id          = "1430818"
        name        = "protect-main-branch-kong-runtime-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"cfd7d2d6203df58921b92f1b79058ab02e0a76bd7dd1b27018fb3ff9ab19b44b\"" -> "W/\"e0772d69987866d641ff34302939858499ac358b56bc433fdd57fec33ad2f36b\""
        id          = "1536655"
        name        = "protect-main-branch-kong-test-suite-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"8effc437d2d5197fc93e894c468a5dd951a3b17065121897d82026aa1d52a7af\"" -> "W/\"64e7e30f97b3226f838e055ca21dde04b3f5deb8d694875f54b3069eca7c6b4e\""
        id          = "1430817"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"6df2b4a5ba1d7a4f400003129e9dfbcb1efdf848ae7bb4f1f367250b91fd5655\"" -> "W/\"cff5e78b027cbd217cef1f237ccd4716b121b969dbefc6c362f046fe6720fc3a\""
        id          = "1430803"
        name        = "protect-main-branch-template-1-github-release-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"ce94ba53a85620443ab221dfb61eb064410f0e4b33ed4608246054400dbcab5a\"" -> "W/\"5491dada14b4403481c21586cbdbafe4c505a4bcfb8ba3a90039337c091cc2c8\""
        id          = "1430814"
        name        = "protect-main-branch-template-1-terraform-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"540fe23a7707a5c1edf98ce0c094578be8f8974e6a07188a524aacf7ebdda168\"" -> "W/\"040ec51ed0968785893d3e826068387164adbb53d34b700bff841b521fadd78d\""
        id          = "1430815"
        name        = "protect-main-branch-template-template-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"34632b8b26abfa9902d22aa10de4111b412e897f7831f2178fddc6c4a40f918f\"" -> "W/\"50f19aa6591bbbb894c54e5cae68f59545e634813f17042297700d5d083e3f95\""
        id          = "1430807"
        name        = "protect-main-branch-terraform-github-pre-commit-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"ad47b6bebde45cca50f626e40894c0a5c198a61bb37d0b128ce09597392150ad\"" -> "W/\"47931e714fb3e88c8ef7065289ba680d90b0c56abbe54024bd4cf979c62d06e7\""
        id          = "1430869"
        name        = "protect-main-branch-kong-build-images-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"47febb2f6c4d06c540697ba002575c9341f7582fcd32b12d4f7f40ac7acfffa9\"" -> "W/\"4337e1ab925e86210ecd0b6c0de2ed6c1671934d6a4bf9206a9da9d207ab5636\""
        id          = "1430871"
        name        = "protect-main-branch-kong-development-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-docker"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"2352695735e6962610622519b1fd11a0da09e777705e36c9cb61dd6fd169a36e\"" -> "W/\"d85a77dde7c06d44b7ed9fffb736f447d5d2a25297a434dfb577b730f20c7f2f\""
        id          = "1491044"
        name        = "protect-main-branch-kong-docker-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-fuzzy-testing"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"c292da189b3875cac7b102588d825f4b620c6fa59d86cfce15a16765f314e7b3\"" -> "W/\"82681977b509f09aaf3588a5e7b26c11748958a69c946bf513bd49561fa66755\""
        id          = "1573962"
        name        = "protect-main-branch-kong-fuzzy-testing-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"41e3c6182d09ac63f5ba6562d61d98a5e402fe65132e3d7a5cd472bff7e40b60\"" -> "W/\"dd24673d1225b23bec533f24141f7b037d5d8b71e3b679dcfab9742e61707818\""
        id          = "1430870"
        name        = "protect-main-branch-kong-openssl-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"b6f6f1048b51dda48b258fba12b8ef6e037d4564de77fef9e52b4f179f0eaaab\"" -> "W/\"602afbcc419908a51c92f6a2a6a455bcf7ff0501be5e6ffde612b0a596265a54\""
        id          = "1430873"
        name        = "protect-main-branch-kong-package-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"8ec1e5d9a24878ec5a73b07884adb866d033a8a45e3df48cef9ec0988c902bcb\"" -> "W/\"1d0182b0defc7ccce57281524865653a5d623cf27c74e967818d4b8b2c60c544\""
        id          = "1430868"
        name        = "protect-main-branch-kong-runtime-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"d0c3d369fcb520f6464d6c8378919d8d8373284e843694536e10b511c5cd375d\"" -> "W/\"e90609c13d9cbf14773d169d7b4592b9ac6a88b1ee3543e3b017ffee5946985a\""
        id          = "1536657"
        name        = "protect-main-branch-kong-test-suite-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"b84a47639cfc35de675792633f3aea5b173e35c42b30be5f34c44e85666621a7\"" -> "W/\"7f008b0302f0b961168531e59e85815586797128633439223c9d923201c0694c\""
        id          = "1430872"
        name        = "protect-main-branch-multi-arch-fpm-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"1f8e5390753e42a8bd33b664e2441b78c19c159772a299889cbd0b80ca78940d\"" -> "W/\"3e915b35f25a91d091ef19e37fb2d8a1c48f73829a89c832529951508a904b9d\""
        id          = "1431038"
        name        = "protect-main-branch-template-1-github-release-release-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"9f26cadc00aa7e2dcb24c44e1ad3f3f05e84d750539aab67feac9bf6373788c5\"" -> "W/\"196d5cb47685336106d5e9ee520ca1530503a80e78810165b25b9cff2a7be6ed\""
        id          = "1430865"
        name        = "protect-main-branch-template-1-terraform-terraform-plan-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"dd3c8cd6afccd6893a1f89f6fb5c5bb565b93a439aa06401e30eccf6255479ab\"" -> "W/\"5a3306165677ae713f07c1d6e6f814c7307bcedfc6a0aa195e456eec62753387\""
        id          = "1430864"
        name        = "protect-main-branch-terraform-github-terraform-plan-20250331-060334"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1481994"
      ~ name        = "protect-main-branch-atc-router-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430804"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430806"
      ~ name        = "protect-main-branch-kong-development-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-docker"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1491043"
      ~ name        = "protect-main-branch-kong-docker-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-fuzzy-testing"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1573964"
      ~ name        = "protect-main-branch-kong-fuzzy-testing-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430805"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430802"
      ~ name        = "protect-main-branch-kong-package-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430818"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1536655"
      ~ name        = "protect-main-branch-kong-test-suite-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430817"
      ~ name        = "protect-main-branch-multi-arch-fpm-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430803"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430814"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430815"
      ~ name        = "protect-main-branch-template-template-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430807"
      ~ name        = "protect-main-branch-terraform-github-pre-commit-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["theguild"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "theguild"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430869"
      ~ name        = "protect-main-branch-kong-build-images-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430871"
      ~ name        = "protect-main-branch-kong-development-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-docker"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1491044"
      ~ name        = "protect-main-branch-kong-docker-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-fuzzy-testing"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1573962"
      ~ name        = "protect-main-branch-kong-fuzzy-testing-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430870"
      ~ name        = "protect-main-branch-kong-openssl-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430873"
      ~ name        = "protect-main-branch-kong-package-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430868"
      ~ name        = "protect-main-branch-kong-runtime-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1536657"
      ~ name        = "protect-main-branch-kong-test-suite-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430872"
      ~ name        = "protect-main-branch-multi-arch-fpm-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1431038"
      ~ name        = "protect-main-branch-template-1-github-release-release-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430865"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430864"
      ~ name        = "protect-main-branch-terraform-github-terraform-plan-20250331-060334" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 26 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->